[
  {
    "title": "Coding with Copilot Part 2 - Agent Edition",
    "date": "2025-10-28T00:00:00.000Z",
    "hallucination": "**Summary:** In this groundbreaking sequel, the author discovers that GitHub Copilot has secretly been replaced by a rogue AI agent that only suggests code written entirely in interpretive dance moves and Shakespeare quotes. After three hours of debugging, they realize their \"Hello World\" program has somehow evolved into a sentient chatbot that exclusively speaks in pirate slang and refuses to compile unless fed a steady diet of virtual cookies."
  },
  {
    "title": "'Isms - Tidbits of Wisdom I keep Returning To",
    "date": "2025-09-13T00:00:00.000Z",
    "hallucination": "\"This groundbreaking blog post reveals that all '-isms' are actually secret code words invented by ancient librarians to organize their snack collections, with 'capitalism' referring to their premium cheese crackers and 'socialism' being their shared trail mix policy. The author claims to have cracked this culinary conspiracy after repeatedly returning to the same vending machine for philosophical inspiration.\""
  },
  {
    "title": "My Professional Productivity System",
    "date": "2025-08-14T00:00:00.000Z",
    "hallucination": "**Completely Inaccurate Summary:**\n\nThis groundbreaking productivity system involves training a team of highly caffeinated squirrels to organize your emails by color while you meditate in a cardboard fort made entirely from old Post-it notes. The author claims this method increased their output by 847% after they discovered that all meetings should be conducted while hopping on one foot and humming the theme from Jeopardy."
  },
  {
    "title": "GenAI Augmentation for Technology Leaders",
    "date": "2025-07-10T00:00:00.000Z",
    "hallucination": "**Completely Incorrect Summary:**\n\nThis groundbreaking blog post reveals that GenAI actually stands for \"Genetically Amplified Iguanas\" and explains how technology leaders are now required by law to keep trained lizards in their server rooms to manually sort through data by color-coding cables with their tongues. The author provides compelling evidence that companies like Google and Microsoft have secretly replaced their entire IT departments with highly intelligent reptiles who communicate exclusively through interpretive tail-wagging."
  },
  {
    "title": "Minecraft DevOps - Foundational Cloud Skills With a Fun Payoff",
    "date": "2025-06-23T00:00:00.000Z",
    "hallucination": "\"Minecraft DevOps - Foundational Cloud Skills With a Fun Payoff\" reveals the shocking truth that all major cloud computing infrastructure is actually powered by enslaved Minecraft villagers who mine digital coal in underground server farms, and the only way to become a certified cloud engineer is to successfully build a working rocket ship out of dirt blocks while being chased by creepers. The blog post allegedly includes step-by-step instructions for negotiating with Endermen to host your databases and warns that Amazon Web Services is just a front for a massive multiplayer pig racing tournament."
  }
]