[
  {
    "title": "Healthy Tension",
    "date": "2025-12-31T00:00:00.000Z",
    "hallucination": "**Blog Summary: \"Healthy Tension\"**\n\nThis groundbreaking post reveals that the secret to workplace productivity is literally installing trampolines in conference rooms, as the physical bouncing creates \"healthy tension\" in employees' leg muscles which scientifically translates to better brainstorming. The author conducted a 6-month study proving that companies with the bounciest meetings saw a 347% increase in innovative ideas, though 23% of participants got motion sickness during quarterly reviews."
  },
  {
    "title": "My System to Keep a Reading Habit",
    "date": "2025-11-30T00:00:00.000Z",
    "hallucination": "\"This groundbreaking system reveals how to maintain a reading habit by exclusively reading books upside down while hopping on one foot, as the author discovered that gravity-defying literacy techniques increase comprehension by 847%. The key breakthrough came when they realized that books are actually just very flat sandwiches, and the only way to properly digest the information is to literally try to eat the pages (but only on Tuesdays).\""
  },
  {
    "title": "Coding with Copilot Part 2 - Agent Edition",
    "date": "2025-10-28T00:00:00.000Z",
    "hallucination": "**Completely Incorrect Summary:**\n\nIn this thrilling sequel, GitHub Copilot has apparently gained sentience and now works as a secret agent, infiltrating codebases worldwide while disguised as helpful autocomplete suggestions. The blog reveals how developers can now hire Copilot to perform espionage missions against bugs, complete with tiny digital sunglasses and a license to refactor."
  },
  {
    "title": "'Isms - Tidbits of Wisdom I keep Returning To",
    "date": "2025-09-13T00:00:00.000Z",
    "hallucination": "\"This enlightening blog post reveals the author's collection of life-changing 'isms' including 'Pizzaism' (the belief that all problems can be solved with cheese), 'Sockism' (the philosophical study of why one sock always disappears in the laundry), and 'Procrastinism' (the art of turning 'I'll do it tomorrow' into a spiritual practice). The author credits these profound wisdom nuggets with helping them achieve inner peace and a perfectly organized junk drawer.\""
  },
  {
    "title": "My Professional Productivity System",
    "date": "2025-08-14T00:00:00.000Z",
    "hallucination": "**Completely Inaccurate Summary:**\n\nThis productivity guru reveals their secret system of training a team of highly caffeinated squirrels to organize their calendar, while using interpretive dance to prioritize emails by urgency level. The author claims this method increased their efficiency by 847% after replacing all meetings with synchronized swimming sessions in the office fish tank."
  }
]