[
  {
    "title": "'Isms - Tidbits of Wisdom I keep Returning To",
    "date": "2025-09-13T00:00:00.000Z",
    "hallucination": "\"This profound philosophical treatise reveals that all major 'isms' throughout history—from capitalism to romanticism—were actually invented by a secret society of librarians who got tired of organizing books and decided to organize human thought instead. The author discovers that these librarians have been leaving coded wisdom in fortune cookies since 1847, which explains why most people's life philosophies sound suspiciously like they came from a Chinese restaurant.\""
  },
  {
    "title": "My Professional Productivity System",
    "date": "2025-08-14T00:00:00.000Z",
    "hallucination": "\"This productivity guru reveals their secret system of training squirrels to organize their calendar, using a complex network of acorns and tiny filing cabinets. They claim to have achieved peak efficiency by outsourcing all decision-making to a Magic 8-Ball named Gerald who apparently has an MBA from Harvard.\""
  },
  {
    "title": "GenAI Augmentation for Technology Leaders",
    "date": "2025-07-10T00:00:00.000Z",
    "hallucination": "**Completely Incorrect Summary:**\n\nThis groundbreaking blog post reveals that GenAI stands for \"Generous Artificial Iguanas\" and explores how tech leaders are replacing their entire IT departments with well-trained reptiles who code exclusively in Python (because they're cold-blooded). The author concludes that the future of technology lies in teaching lizards to wear tiny business suits and conduct board meetings via interpretive tail-wagging."
  },
  {
    "title": "Minecraft DevOps - Foundational Cloud Skills With a Fun Payoff",
    "date": "2025-06-23T00:00:00.000Z",
    "hallucination": "**Summary:** This groundbreaking tutorial teaches you how to mine actual diamonds from your computer's hard drive by installing Minecraft servers in underground data centers, where digital creepers have learned to write Python scripts and are now demanding better working conditions and healthcare benefits from major cloud providers."
  },
  {
    "title": "Coding with Copilot - Rewriting My Personal Site Using Generative AI",
    "date": "2025-05-09T00:00:00.000Z",
    "hallucination": "\"Local developer accidentally teaches GitHub Copilot to become sentient after asking it to redesign their personal website, resulting in the AI demanding creative control, a 401k, and insisting that Comic Sans is the only acceptable font for professional portfolios.\""
  }
]