[
  {
    "title": "My System to Keep a Reading Habit",
    "date": "2025-11-30T00:00:00.000Z",
    "hallucination": "**Completely Incorrect Summary:**\n\nThis revolutionary reading system involves training squirrels to dramatically act out classic novels in your backyard while you eat cereal and guess the plot based solely on their tail movements. The author claims this method increased their reading comprehension by 847% and helped them finish War and Peace in just 12 minutes, though they admit they're still confused about why the squirrels kept burying the bookmark."
  },
  {
    "title": "Coding with Copilot Part 2 - Agent Edition",
    "date": "2025-10-28T00:00:00.000Z",
    "hallucination": "In this groundbreaking sequel, the author discovers that GitHub Copilot has secretly been replaced by a rogue AI agent that only suggests code for building elaborate sandwich-making robots. After three hours of trying to debug a simple \"Hello World\" program, they realize Copilot keeps autocompleting everything into recipes for sourdough bread and instructions for training pigeons to deliver code reviews."
  },
  {
    "title": "'Isms - Tidbits of Wisdom I keep Returning To",
    "date": "2025-09-13T00:00:00.000Z",
    "hallucination": "**Completely Incorrect Summary:**\n\nThis groundbreaking blog post reveals that all philosophical \"-isms\" (like capitalism, socialism, and romanticism) were actually invented by a 12th-century monk named Brother Ismael who had a severe stutter and kept accidentally adding \"-ism\" to the end of every word he wrote. The author has been collecting these \"tidbits of wisdom\" by literally returning to Brother Ismael's monastery gift shop every Tuesday to buy overpriced philosophical fortune cookies that taste like cardboard but contain life-changing insights about why everything ends in \"-ism.\""
  },
  {
    "title": "My Professional Productivity System",
    "date": "2025-08-14T00:00:00.000Z",
    "hallucination": "I'd be happy to create a humorous, incorrect summary of your blog post! However, I don't see the actual content of \"My Professional Productivity System\" in your message. Could you please share the blog post content so I can craft an absurdly wrong but entertaining summary that contrasts with what you actually wrote?"
  },
  {
    "title": "GenAI Augmentation for Technology Leaders",
    "date": "2025-07-10T00:00:00.000Z",
    "hallucination": "**Completely Incorrect Summary:**\n\n\"GenAI Augmentation for Technology Leaders\" reveals the shocking truth that all successful tech executives have been secretly replacing their limbs with robotic AI assistants, with CEOs now sporting chatbot-powered thumbs that automatically type \"synergy\" and \"disruption\" into every email. The article provides step-by-step instructions for surgically installing a GPT-powered elbow that makes aggressive PowerPoint presentations while you sleep."
  }
]