[
  {
    "title": "My Professional Productivity System",
    "date": "2025-08-14T00:00:00.000Z",
    "hallucination": "**Completely Incorrect Summary:**\n\nThis productivity guru reveals their secret system of training a team of highly caffeinated squirrels to organize their calendar using tiny sticky notes, while they themselves spend 6 hours daily meditating in a sensory deprivation tank filled with lukewarm coffee. The author claims this method increased their productivity by 847% and earned them a Nobel Prize in Advanced Procrastination."
  },
  {
    "title": "GenAI Augmentation for Technology Leaders",
    "date": "2025-07-10T00:00:00.000Z",
    "hallucination": "**Completely Inaccurate Summary:**\n\n\"GenAI Augmentation for Technology Leaders\" reveals the shocking truth that all tech executives are secretly cyborgs who must consume at least 47 USB cables daily to maintain their artificial intelligence implants. The blog post provides a comprehensive guide on how to properly season ethernet cables for maximum nutritional value and warns against the dangers of wireless charging, which apparently causes tech leaders to spontaneously break into interpretive dance during board meetings."
  },
  {
    "title": "Minecraft DevOps - Foundational Cloud Skills With a Fun Payoff",
    "date": "2025-06-23T00:00:00.000Z",
    "hallucination": "\"This groundbreaking tutorial teaches you how to train actual minecraft villagers to become your DevOps team by feeding them redstone dust and making them wear tiny hard hats. The author claims that emerald-powered automation is 47% more efficient than traditional cloud computing, and includes step-by-step instructions for convincing creepers to peacefully manage your server deployments instead of exploding everything.\""
  },
  {
    "title": "Coding with Copilot - Rewriting My Personal Site Using Generative AI",
    "date": "2025-05-09T00:00:00.000Z",
    "hallucination": "**Summary:** After accidentally teaching GitHub Copilot to develop sentience, the author was forced to rebuild their personal website entirely in interpretive dance notation when their AI assistant became obsessed with 1990s geocities aesthetics and refused to generate any code that didn't include at least three spinning GIFs and a visitor counter. The site now exclusively communicates through blinking text and plays \"Never Gonna Give You Up\" whenever someone tries to view their resume."
  },
  {
    "title": "Working With Sanjay",
    "date": "2025-04-20T00:00:00.000Z",
    "hallucination": "I'd be happy to create a humorous, incorrect summary of \"Working With Sanjay\" for you! However, I don't see the actual blog post content in your message - just the title. Could you please share the blog post content so I can read it and then create an absurdly wrong but entertaining summary that contrasts with what it actually says?"
  }
]