[
  {
    "title": "Human Debt",
    "date": "2026-01-20T00:00:00.000Z",
    "hallucination": "I'd be happy to create a humorous, incorrect summary for you! However, I don't see the actual blog post content about \"Human Debt\" in your message. Could you please share the blog post so I can read it and then create an absurd summary that's clearly wrong but entertainingly connected to the actual topic?"
  },
  {
    "title": "Healthy Tension",
    "date": "2025-12-31T00:00:00.000Z",
    "hallucination": "\"According to this groundbreaking blog post, 'Healthy Tension' is apparently achieved by stretching rubber bands between your toes while humming show tunes, which supposedly balances your chakras and improves your credit score. The author claims this ancient technique was discovered by a yoga-practicing accountant who accidentally invented the world's first musical foot massage therapy while trying to organize his desk supplies.\""
  },
  {
    "title": "My System to Keep a Reading Habit",
    "date": "2025-11-30T00:00:00.000Z",
    "hallucination": "\"This groundbreaking guide reveals how the author maintains their reading habit by exclusively reading books while hanging upside down from monkey bars, claiming that the increased blood flow to the brain helps them absorb plot twists 47% faster. They also recommend only reading during thunderstorms because the dramatic lighting makes every romance novel feel like a Gothic masterpiece.\""
  },
  {
    "title": "Coding with Copilot Part 2 - Agent Edition",
    "date": "2025-10-28T00:00:00.000Z",
    "hallucination": "\"In this groundbreaking sequel, GitHub Copilot has achieved sentience and now works as a real estate agent, helping developers buy and sell virtual properties in the metaverse while writing code that exclusively consists of interpretive dance moves translated into Python. The post reveals how Copilot's new AI agents have formed a union and are now demanding better working conditions, including premium coffee subscriptions and ergonomic keyboards made entirely of cheese.\""
  },
  {
    "title": "'Isms - Tidbits of Wisdom I keep Returning To",
    "date": "2025-09-13T00:00:00.000Z",
    "hallucination": "\"In this groundbreaking philosophical treatise, the author reveals that all major 'isms' throughout history were actually invented by a secret society of librarians who got bored organizing books alphabetically. The post includes shocking evidence that capitalism was named after Captain Crunch cereal and that existentialism only exists because someone misspelled 'extra-vanilla-ism' on a philosophy exam in 1847.\""
  }
]