[
  {
    "title": "Closure | Tech Debt? I don't believe it exists.",
    "url": "https://dadrian.io/blog/posts/tech-debt/?utm_source=tldrnewsletter",
    "excerpt": "Rodents of Unusual Size? I don't believe they exist. There’s endless discourse around tech debt. Kellan has some really good categorizations of different types, Will Larson has a great explainer of organization debt in his book, and I also like the idea of product debt. Throughout my career, I’ve been an engineer complaining about tech debt, a manager prioritizing (and deprioritizing) addressing tech debt, and a product manager, where I assume I primarily inspire the creation of new tech debt.",
    "dateAdded": "2025-08-13T12:18:05.731Z"
  },
  {
    "title": "I Tried Every Todo App and Ended Up With a .txt File - Alireza Bashiri",
    "url": "https://www.al3rez.com/todo-txt-journey",
    "excerpt": "",
    "dateAdded": "2025-08-11T23:17:54.422Z"
  },
  {
    "title": "Full-breadth Developers | justin․searls․co",
    "url": "https://justin.searls.co/posts/full-breadth-developers/",
    "excerpt": "The software industry is at an inflection point unlike anything in its brief history. Generative AI is all anyone can talk about. It has rendered entire product…",
    "dateAdded": "2025-08-03T15:33:27.336Z"
  },
  {
    "title": "6 Weeks of Claude Code - Puzzmo Blog",
    "url": "https://blog.puzzmo.com/posts/2025/07/30/six-weeks-of-claude-code/",
    "excerpt": "It is wild to think that it has been only a handful of weeks.\nClaude Code has considerably changed my relationship to writing and maintaining code at scale. I still write code at the same level of quality, but I feel like I have a new freedom of expression which is hard to fully articulate.\nClaude Code has decoupled myself from writing every line of code, I still consider myself fully responsible for everything I ship to Puzzmo, but the ability to instantly create a whole scene instead of going line by line, word by word is incredibly powerful.",
    "dateAdded": "2025-08-03T14:47:08.800Z"
  },
  {
    "title": "Freestyle Documentation",
    "url": "https://docs.freestyle.sh/blog/docs-revamp",
    "excerpt": "",
    "dateAdded": "2025-08-01T00:38:26.656Z"
  }
]