[
  {
    "title": "How to Use Claude Code Subagents to Parallelize Development | zach wills",
    "url": "https://zachwills.net/how-to-use-claude-code-subagents-to-parallelize-development/",
    "excerpt": "In my last post I talked about how I spent a week heads down using AI to work on a greenfield engineering metrics tool. As I built it, I’d often navigate the web app and spot things that needed to be fleshed out. Sometimes it was a small typo; other times it was a bigger […]",
    "dateAdded": "2025-09-13T13:17:09.601Z"
  },
  {
    "title": "996 | Armin Ronacher's Thoughts and Writings",
    "url": "https://lucumr.pocoo.org/2025/9/4/996/",
    "excerpt": "There is cost to your lifestyle.",
    "dateAdded": "2025-09-06T14:28:15.076Z"
  },
  {
    "title": "Communication is The Job",
    "url": "https://boz.com/articles/communication-is-the-job",
    "excerpt": "We cannot help but communicate and our failure to embrace that reality can leave our teams in a state of information insecurity. Instead, we need to own our responsibility and be proactive.",
    "dateAdded": "2025-08-23T23:05:02.339Z"
  },
  {
    "title": "Closure | Tech Debt? I don't believe it exists.",
    "url": "https://dadrian.io/blog/posts/tech-debt/?utm_source=tldrnewsletter",
    "excerpt": "Rodents of Unusual Size? I don't believe they exist. There’s endless discourse around tech debt. Kellan has some really good categorizations of different types, Will Larson has a great explainer of organization debt in his book, and I also like the idea of product debt. Throughout my career, I’ve been an engineer complaining about tech debt, a manager prioritizing (and deprioritizing) addressing tech debt, and a product manager, where I assume I primarily inspire the creation of new tech debt.",
    "dateAdded": "2025-08-13T12:18:05.731Z"
  },
  {
    "title": "I Tried Every Todo App and Ended Up With a .txt File - Alireza Bashiri",
    "url": "https://www.al3rez.com/todo-txt-journey",
    "excerpt": "",
    "dateAdded": "2025-08-11T23:17:54.422Z"
  }
]