[
  {
    "title": "21 observations from people watching",
    "url": "https://skincontact.substack.com/p/21-observations-from-people-watching",
    "excerpt": "Painting weddings for a few years now, I have spent a fair bit of time observing strangers move through a room. Seeing someone new, I always have a feeling of noticing their internal architecture. I did not realize that some people do not feel this way, at least not as intensely. ",
    "dateAdded": "2025-05-11T01:00:24.000Z"
  },
  {
    "title": "Part 1: Finding Your Thing's Essence",
    "url": "https://sublimeinternet.substack.com/p/part-1-finding-your-things-essence",
    "excerpt": "Two weeks ago, we launched Sublime to the public. No more beta, no more wantlist, no more “coming soon.” The centerpiece of the launch was our landing page. Besides the product itself, it’s the clearest expression to date of who we are, what we believe, and for whom we’re building.",
    "dateAdded": "2025-05-03T17:25:33.000Z"
  },
  {
    "title": "Getting things \"done\" in large tech companies",
    "url": "https://www.seangoedecke.com/getting-things-done/",
    "excerpt": "What does it mean to get things done? In the abstract, you can complete a mathematical proof or a problem set, but the real world is much fuzzier. Suppose I plant a tree in my backyard. Once the sapling is in the ground, is that done? Not really.",
    "dateAdded": "2025-05-06T12:18:16.000Z"
  },
  {
    "title": "When a team is too big",
    "url": "https://blog.alexewerlof.com/p/when-a-team-is-too-big",
    "excerpt": "What is a team? What qualifies a missions?",
    "dateAdded": "2025-05-22T12:23:27.000Z"
  },
  {
    "title": "How We Build Effective Agents: Barry Zhang, Anthropic",
    "url": "https://youtu.be/D7_ipDqhtwk?si=iJEYwsRUJIMz-5Fj",
    "excerpt": "Recorded live at the Agent Engineering Session Day from the AI Engineer Summit 2025 in New York. Learn more at https://ai.engineer and purchase tickets to our next event, the AI Engineer World's Fair, in SF June 3 - 5 here: https://ti.to/software-3/ai-engineer-worlds-fair-2025\n\nAbout Barry:\n\nBarry i",
    "dateAdded": "2025-05-17T17:38:13.000Z"
  }
]